#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.prod.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Reading...
module.prod.data.archive_file.http_function_source["http"]: Reading...
module.prod.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Reading...
module.prod.data.archive_file.pubsub_function_source["cloudErrorLog"]: Reading...
module.prod.data.archive_file.pubsub_function_source["privateMessage"]: Reading...
module.prod.data.archive_file.pubsub_function_source["channelMessage"]: Reading...
module.prod.data.archive_file.pubsub_function_source["stm"]: Reading...
module.prod.data.archive_file.pubsub_function_source["exp"]: Reading...
module.prod.data.archive_file.pubsub_function_source["cloudDeploymentLog"]: Reading...
module.prod.data.archive_file.pubsub_function_source["cloudErrorLog"]: Read complete after 0s [id=c97bdc87edf3230c7f079530555818a0473cc8a2]
module.prod.data.archive_file.http_function_source["http"]: Read complete after 0s [id=c221dc2f104f758030579ea39e14ee1746c73f73]
module.prod.data.archive_file.pubsub_function_source["cloudDeploymentLog"]: Read complete after 0s [id=ba45a2283b0dfbb4403df49a975ffab286eb54ed]
module.prod.data.archive_file.pubsub_function_source["privateMessage"]: Read complete after 0s [id=fea4d40761f0c4d7e4ade9234aff3c676d56b179]
module.prod.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Read complete after 0s [id=bb50d45869c6b4f000af3f5dbaf705dc3547deb6]
module.prod.data.archive_file.http_function_source["help"]: Reading...
module.prod.data.archive_file.http_function_source["video"]: Reading...
module.prod.data.archive_file.http_function_source["exam"]: Reading...
module.prod.data.archive_file.pubsub_function_source["exp"]: Read complete after 0s [id=3b63dbff8ec0fde6c28727f84ce814edcab313f9]
module.prod.data.archive_file.http_function_source["js"]: Reading...
module.prod.data.archive_file.pubsub_function_source["channelMessage"]: Read complete after 0s [id=b9c78aa296e3992a534329ee12e9400c1db846c2]
module.prod.data.archive_file.pubsub_function_source["stm"]: Read complete after 0s [id=85bee5ab989980582145784fcddf19af755cfff6]
module.prod.data.archive_file.http_function_source["exam"]: Read complete after 0s [id=de84a649e65565d61e8a1a7a1a7d53dff2f906e0]
module.prod.data.archive_file.http_function_source["go"]: Reading...
module.prod.data.archive_file.http_function_source["video"]: Read complete after 0s [id=428553a64384a42bd7c9e918bd72bb240172e07d]
module.prod.data.archive_file.http_function_source["help"]: Read complete after 0s [id=e4f9818109e6d3c6fb840ab00b90c99a6637c51a]
module.prod.data.archive_file.http_function_source["listwarn"]: Reading...
module.prod.data.archive_file.http_function_source["java"]: Reading...
module.prod.data.archive_file.http_function_source["flag"]: Reading...
module.prod.data.archive_file.http_function_source["go"]: Read complete after 0s [id=ca54a48bb5d689229b9e2ee441ea2611944ae713]
module.prod.data.archive_file.http_function_source["leaderboard"]: Reading...
module.prod.data.archive_file.http_function_source["listwarn"]: Read complete after 0s [id=2ac77fd164c9303aa5a90d42c11499d849d35e0c]
module.prod.data.archive_file.http_function_source["gif"]: Reading...
module.prod.data.archive_file.http_function_source["js"]: Read complete after 0s [id=358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7]
module.prod.data.archive_file.http_function_source["gif"]: Read complete after 0s [id=ade2bf534a1bf94beac9b4924ebb04d92f75a7a3]
module.prod.data.archive_file.http_function_source["froge"]: Reading...
module.prod.data.archive_file.http_function_source["ban"]: Reading...
module.prod.data.archive_file.http_function_source["warn"]: Reading...
module.prod.data.archive_file.http_function_source["java"]: Read complete after 0s [id=5c394ffff4f20dea8bc47029905259fa732a6a85]
module.prod.data.archive_file.http_function_source["leaderboard"]: Read complete after 0s [id=a793316da15897fe031a9c29bc977344a76cf676]
module.prod.data.archive_file.http_function_source["flag"]: Read complete after 0s [id=3c324e538a1c52e11b42bf3fdd2e95c1c00a5783]
module.prod.data.archive_file.http_function_source["ban"]: Read complete after 0s [id=87b0639e469a259184e4476cecc809db187ff634]
module.prod.data.archive_file.http_function_source["src"]: Reading...
module.prod.data.archive_file.http_function_source["describe"]: Reading...
module.prod.data.archive_file.http_function_source["answer"]: Reading...
module.prod.data.archive_file.http_function_source["warn"]: Read complete after 0s [id=23711e28cc000cf97afea64131ad0b918084cc7e]
module.prod.data.archive_file.http_function_source["froge"]: Read complete after 0s [id=3cc29d594cea4df8c8f6af667a222fd97647a685]
module.prod.data.archive_file.pubsub_function_source["updateUserRole"]: Reading...
module.prod.data.archive_file.http_function_source["src"]: Read complete after 0s [id=d283a62085b3665676857075d5397e051990724b]
module.prod.data.archive_file.http_function_source["level"]: Reading...
module.prod.data.archive_file.http_function_source["describe"]: Read complete after 0s [id=8149d3888af4d77844b83253c94a05cff143ff3f]
module.prod.data.archive_file.http_function_source["answer"]: Read complete after 0s [id=7e22dcbeb314c119af927f2a07d84c91bc783619]
module.prod.data.archive_file.http_function_source["hello"]: Reading...
module.prod.data.archive_file.pubsub_function_source["updateUserRole"]: Read complete after 0s [id=70bbdeada9ccdbd989dadcb475dd9947b0cc95c6]
module.prod.data.archive_file.http_function_source["level"]: Read complete after 0s [id=86266b212ea30aedbd643f308be80bb12d0a5fd6]
module.prod.data.archive_file.http_function_source["hello"]: Read complete after 0s [id=d3aff51c68f98c729867e28f35be543c27184d8e]
module.prod.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Read complete after 1s [id=fb5b8e282eae12a8868a48ad95e317a9eaf88467]
module.prod.google_pubsub_topic.pubsub_topic["froge_of_the_day"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_froge_of_the_day]
module.prod.google_logging_project_sink.cloud_function_crud_sing: Refreshing state... [id=projects/archy-f06ed/sinks/archy-cloud-function-crud-prod]
module.prod.google_pubsub_topic.pubsub_topic["private_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_private_message_discord]
module.prod.google_pubsub_topic.pubsub_topic["update_user_role"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_update_user_role]
module.prod.google_logging_project_sink.cloud_function_error_sink: Refreshing state... [id=projects/archy-f06ed/sinks/archy-cloud-function-error-prod]
module.prod.google_pubsub_topic.pubsub_topic["cloud_function_error_log"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_cloud_function_error_log]
module.prod.google_cloud_scheduler_job.stm_status_scheduler[0]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/jobs/stm_status]
module.prod.google_storage_bucket.froge: Refreshing state... [id=froge-public-bucket-prod]
module.prod.google_compute_instance.default: Refreshing state... [id=projects/archy-f06ed/zones/us-central1-a/instances/e2-micro-archy]
module.prod.google_storage_bucket.function_bucket: Refreshing state... [id=archy-f06ed-function-prod]
module.prod.google_pubsub_topic.pubsub_topic["cloud_function_crud_log"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_cloud_function_crud_log]
module.prod.google_pubsub_topic.pubsub_topic["exp_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_exp_discord]
module.prod.google_pubsub_topic.pubsub_topic["generate_welcome_image"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_generate_welcome_image]
module.prod.google_pubsub_topic.pubsub_topic["stm_status"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_stm_status]
module.prod.google_pubsub_topic.pubsub_topic["channel_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/prod_channel_message_discord]
module.prod.google_secret_manager_secret.secret["STM_API_KEY"]: Refreshing state... [id=projects/archy-f06ed/secrets/STM_API_KEY]
module.prod.google_secret_manager_secret.secret["TENOR_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/TENOR_API_TOKEN]
module.prod.google_secret_manager_secret.secret["YOUTUBE_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/YOUTUBE_API_TOKEN]
module.prod.google_secret_manager_secret.secret["DISCORD_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/DISCORD_TOKEN]
module.prod.google_cloud_scheduler_job.froge_of_the_day_scheduler[0]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/jobs/froge_of_the_day]
module.prod.google_storage_bucket_access_control.public_rule: Refreshing state... [id=froge-public-bucket-prod/allUsers]
module.prod.google_storage_bucket_object.http_function_zip["video"]: Refreshing state... [id=archy-f06ed-function-prod-src-428553a64384a42bd7c9e918bd72bb240172e07d.zip]
module.prod.google_storage_bucket_object.http_function_zip["ban"]: Refreshing state... [id=archy-f06ed-function-prod-src-87b0639e469a259184e4476cecc809db187ff634.zip]
module.prod.google_storage_bucket_object.http_function_zip["describe"]: Refreshing state... [id=archy-f06ed-function-prod-src-8149d3888af4d77844b83253c94a05cff143ff3f.zip]
module.prod.google_storage_bucket_object.http_function_zip["froge"]: Refreshing state... [id=archy-f06ed-function-prod-src-3cc29d594cea4df8c8f6af667a222fd97647a685.zip]
module.prod.google_storage_bucket_object.http_function_zip["http"]: Refreshing state... [id=archy-f06ed-function-prod-src-c221dc2f104f758030579ea39e14ee1746c73f73.zip]
module.prod.google_storage_bucket_object.http_function_zip["java"]: Refreshing state... [id=archy-f06ed-function-prod-src-5c394ffff4f20dea8bc47029905259fa732a6a85.zip]
module.prod.google_storage_bucket_object.http_function_zip["help"]: Refreshing state... [id=archy-f06ed-function-prod-src-e4f9818109e6d3c6fb840ab00b90c99a6637c51a.zip]
module.prod.google_storage_bucket_object.http_function_zip["hello"]: Refreshing state... [id=archy-f06ed-function-prod-src-d3aff51c68f98c729867e28f35be543c27184d8e.zip]
module.prod.google_storage_bucket_object.http_function_zip["js"]: Refreshing state... [id=archy-f06ed-function-prod-src-358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7.zip]
module.prod.google_storage_bucket_object.http_function_zip["gif"]: Refreshing state... [id=archy-f06ed-function-prod-src-ade2bf534a1bf94beac9b4924ebb04d92f75a7a3.zip]
module.prod.google_storage_bucket_object.http_function_zip["level"]: Refreshing state... [id=archy-f06ed-function-prod-src-86266b212ea30aedbd643f308be80bb12d0a5fd6.zip]
module.prod.google_storage_bucket_object.http_function_zip["listwarn"]: Refreshing state... [id=archy-f06ed-function-prod-src-2ac77fd164c9303aa5a90d42c11499d849d35e0c.zip]
module.prod.google_storage_bucket_object.http_function_zip["go"]: Refreshing state... [id=archy-f06ed-function-prod-src-ca54a48bb5d689229b9e2ee441ea2611944ae713.zip]
module.prod.google_storage_bucket_object.http_function_zip["warn"]: Refreshing state... [id=archy-f06ed-function-prod-src-23711e28cc000cf97afea64131ad0b918084cc7e.zip]
module.prod.google_storage_bucket_object.http_function_zip["answer"]: Refreshing state... [id=archy-f06ed-function-prod-src-7e22dcbeb314c119af927f2a07d84c91bc783619.zip]
module.prod.google_storage_bucket_object.http_function_zip["leaderboard"]: Refreshing state... [id=archy-f06ed-function-prod-src-a793316da15897fe031a9c29bc977344a76cf676.zip]
module.prod.google_storage_bucket_object.http_function_zip["exam"]: Refreshing state... [id=archy-f06ed-function-prod-src-de84a649e65565d61e8a1a7a1a7d53dff2f906e0.zip]
module.prod.google_storage_bucket_object.http_function_zip["src"]: Refreshing state... [id=archy-f06ed-function-prod-src-d283a62085b3665676857075d5397e051990724b.zip]
module.prod.google_storage_bucket_object.http_function_zip["flag"]: Refreshing state... [id=archy-f06ed-function-prod-src-3c324e538a1c52e11b42bf3fdd2e95c1c00a5783.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["frogeOfTheDay"]: Refreshing state... [id=archy-f06ed-function-prod-src-fb5b8e282eae12a8868a48ad95e317a9eaf88467.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["stm"]: Refreshing state... [id=archy-f06ed-function-prod-src-6f8f8e750874119871bbdd1b5ac1d2ee206cc003.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["generateWelcomeImage"]: Refreshing state... [id=archy-f06ed-function-prod-src-bb50d45869c6b4f000af3f5dbaf705dc3547deb6.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["exp"]: Refreshing state... [id=archy-f06ed-function-prod-src-3b63dbff8ec0fde6c28727f84ce814edcab313f9.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["cloudErrorLog"]: Refreshing state... [id=archy-f06ed-function-prod-src-c97bdc87edf3230c7f079530555818a0473cc8a2.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["privateMessage"]: Refreshing state... [id=archy-f06ed-function-prod-src-fea4d40761f0c4d7e4ade9234aff3c676d56b179.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["channelMessage"]: Refreshing state... [id=archy-f06ed-function-prod-src-b9c78aa296e3992a534329ee12e9400c1db846c2.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["updateUserRole"]: Refreshing state... [id=archy-f06ed-function-prod-src-70bbdeada9ccdbd989dadcb475dd9947b0cc95c6.zip]
module.prod.google_storage_bucket_object.pubsub_function_zip["cloudDeploymentLog"]: Refreshing state... [id=archy-f06ed-function-prod-src-ba45a2283b0dfbb4403df49a975ffab286eb54ed.zip]
module.prod.google_cloudfunctions_function.http_function["src"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_src]
module.prod.google_cloudfunctions_function.http_function["http"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_http]
module.prod.google_cloudfunctions_function.http_function["leaderboard"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_leaderboard]
module.prod.google_cloudfunctions_function.http_function["level"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_level]
module.prod.google_cloudfunctions_function.http_function["froge"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_froge]
module.prod.google_cloudfunctions_function.http_function["js"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_js]
module.prod.google_cloudfunctions_function.http_function["exam"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_exam]
module.prod.google_cloudfunctions_function.http_function["ban"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_ban]
module.prod.google_cloudfunctions_function.http_function["java"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_java]
module.prod.google_cloudfunctions_function.http_function["listwarn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_listwarn]
module.prod.google_cloudfunctions_function.http_function["answer"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_answer]
module.prod.google_cloudfunctions_function.http_function["go"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_go]
module.prod.google_cloudfunctions_function.http_function["video"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_video]
module.prod.google_cloudfunctions_function.http_function["flag"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_flag]
module.prod.google_cloudfunctions_function.http_function["describe"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_describe]
module.prod.google_cloudfunctions_function.http_function["help"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_help]
module.prod.google_cloudfunctions_function.http_function["hello"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_hello]
module.prod.google_cloudfunctions_function.http_function["gif"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_gif]
module.prod.google_cloudfunctions_function.http_function["warn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_warn]
module.prod.google_cloudfunctions_function.pubsub_function["stm"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_stm]
module.prod.google_cloudfunctions_function.pubsub_function["cloudErrorLog"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_cloudErrorLog]
module.prod.google_cloudfunctions_function.pubsub_function["updateUserRole"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_updateUserRole]
module.prod.google_cloudfunctions_function.pubsub_function["exp"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_exp]
module.prod.google_cloudfunctions_function.pubsub_function["generateWelcomeImage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_generateWelcomeImage]
module.prod.google_cloudfunctions_function.pubsub_function["frogeOfTheDay"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_frogeOfTheDay]
module.prod.google_cloudfunctions_function.pubsub_function["cloudDeploymentLog"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_cloudDeploymentLog]
module.prod.google_cloudfunctions_function.pubsub_function["privateMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_privateMessage]
module.prod.google_cloudfunctions_function.pubsub_function["channelMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/prod_channelMessage]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.prod.google_cloudfunctions_function.pubsub_function["stm"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "pubsub_function" {
        id                            = "projects/archy-f06ed/locations/us-central1/functions/prod_stm"
        name                          = "prod_stm"
      ~ source_archive_object         = "src-6f8f8e750874119871bbdd1b5ac1d2ee206cc003.zip" -> "src-85bee5ab989980582145784fcddf19af755cfff6.zip"
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.prod.google_storage_bucket_object.pubsub_function_zip["stm"] must be replaced
-/+ resource "google_storage_bucket_object" "pubsub_function_zip" {
      + content             = (sensitive value)
      ~ crc32c              = "gG3kjg==" -> (known after apply)
      ~ detect_md5hash      = "OOzfm7qcM35GTrBo9k8h+Q==" -> "different hash"
      - event_based_hold    = false -> null
      ~ id                  = "archy-f06ed-function-prod-src-6f8f8e750874119871bbdd1b5ac1d2ee206cc003.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "OOzfm7qcM35GTrBo9k8h+Q==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-prod/o/src-6f8f8e750874119871bbdd1b5ac1d2ee206cc003.zip?generation=1705367194412827&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "src-6f8f8e750874119871bbdd1b5ac1d2ee206cc003.zip" -> "src-85bee5ab989980582145784fcddf19af755cfff6.zip" # forces replacement
      ~ output_name         = "src-6f8f8e750874119871bbdd1b5ac1d2ee206cc003.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-prod/o/src-6f8f8e750874119871bbdd1b5ac1d2ee206cc003.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Mmasson-01, Action: `pull_request`, Workflow: `Terraform plan`*